tests/resources/xml/response/ens_query_valid.xml

<soapenv:Envelope
    xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema"
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
    <soapenv:Header/>
    <soapenv:Body>
        <ConsENSV3Sal
            xmlns="https://www2.agenciatributaria.gob.es/ADUA/internet/es/aeat/dit/adu/aden/ensws/ConsENSV3Sal.xsd">
            <TraModAtBorHEA76>1</TraModAtBorHEA76>
            <ExpDatOfArr>20110809</ExpDatOfArr>
            <ConRefNum>9294408</ConRefNum>
            <IMPOPE>
                <MRN>11ES00999999999999</MRN>
                <DecRegDatTim>201107201730</DecRegDatTim>
                <GOOITEIMP>
                    <IteNumGIIMP>1</IteNumGIIMP>
                    <DocRefDC1>12345678901</DocRefDC1>
                    <IndNoCarga>0</IndNoCarga>
                    <PRODOCD>
                        <DocTypDC>N704</DocTypDC>
                        <DocRefDC>12345678901</DocRefDC>
                    </PRODOCD>
                </GOOITEIMP>
            </IMPOPE>
            <IMPOPE>
                <MRN>11ES00888888888888</MRN>
                <DecRegDatTim>201107231644</DecRegDatTim>
                <GOOITEIMP>
                    <IteNumGIIMP>1</IteNumGIIMP>
                    <DocRefDC1>98765432109</DocRefDC1>
                    <IndNoCarga>0</IndNoCarga>
                    <PRODOCD>
                        <DocTypDC>N704</DocTypDC>
                        <DocRefDC>98765432109</DocRefDC>
                    </PRODOCD>
                </GOOITEIMP>
            </IMPOPE>
        </ConsENSV3Sal>
    </soapenv:Body>
</soapenv:Envelope>
